/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_exception_and_index.c                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jayoon <jayoon@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/20 21:23:08 by jayoon            #+#    #+#             */
/*   Updated: 2022/07/20 22:31:02 by jayoon           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

void	check_exception_and_index(t_stack *a)
{
	while ()
	// 중복 검사
	// 이미 정렬 -> 정상 종료
	// index

}
